// SPDX-FileCopyrightText: 2023 Ledger SAS
// SPDX-License-Identifier: Apache-2.0

/// This library defines types (structs, enums, ...) related to syscalls,
/// that need to be shared between the kernel and the uapi.
///
/// Most important enum is `Syscall`, which defines the list of available
/// syscalls and sets their identifier/number.
///

/// This macro takes an enum and implements fallible conversion from a u8
/// exhaustively, as required by the SVC Handler.
///
/// ```
/// pub enum Syscall {
///     Exit,
/// }
///
/// impl TryFrom<u8> for Syscall {
///     type Error = ();
///     fn try_from(v: u8) -> Result<Self, Self::Error> {
///         match v {
///             x if x == Syscall::Exit as u8 => Ok(Syscall::Exit),
///             _ => Err(())
///         }
///     }
/// }
/// ```
/// (inspired by https://stackoverflow.com/a/58715864)
///
/// It also ensures that there cannot be a mismatch between the u8 value
/// used to define the enum, and the value used for converting to it.
macro_rules! syscall_list {
    ($vis:vis enum $name:ident {
        $($vname:ident,)*
    }) => {
        #[repr(C)]
        #[cfg_attr(debug_assertions, derive(Debug))]
        $vis enum $name {
            $($vname,)*
        }

        impl TryFrom<u8> for $name {
            type Error = Status;

            fn try_from(v: u8) -> Result<Self, Self::Error> {
                match v {
                    $(x if x == $name::$vname as u8 => Ok($name::$vname),)*


/// Sleep mode requested
#[repr(C)]
pub enum SleepMode {
    /// Sleep in shallow mode. External events awake the job
    Shallow,
    /// Sleep in deep mode. No sleep interruption
    Deep,
}

/// Converter for SleepMode type to register-encoded value
impl From<SleepMode> for u32 {
    fn from(mode: SleepMode) -> u32 {
        match mode {
            SleepMode::Shallow => 0,
            SleepMode::Deep => 1,
        }
    }
}

/// Converter from register-encoded or C FFI defined value to SleepMode
impl TryFrom<u32> for SleepMode {
    type Error = Status;
    fn try_from(mode: u32) -> Result<SleepMode, Self::Error> {
        match mode {
            0 => Ok(SleepMode::Shallow),
            1 => Ok(SleepMode::Deep),
            _ => Err(Status::Invalid),
        }
    }
}

/// Low power configuration support, defining the CPU sleep state exit event
///
/// There are multiple HW events that may terminate a low-power hardware cycle.
/// These are separated in two main families:
///
/// - Interrupt event (external interrupt)
/// - external event (not interrupt related)
///
/// Moreover, there is some time when the CPU must NOT enter sleep mode for a
/// given amount of time. This can be set with this CPUSleep configuration state.
///
/// > **FIXME**: the sleep trigger and the sleep constraints shoud be defined in separated
/// > types and calls.
#[repr(C)]
pub enum CPUSleep {
    /// Enter sleep mode and wait for external interrupt
    WaitForInterrupt,
    /// Enter sleep mode and wait for external event
    WaitForEvent,
    /// Disable any enter to the low power mode
    ForbidSleep,
    /// Re-enable low power
    AllowSleep,
}

impl From<CPUSleep> for u32 {
    fn from(mode: CPUSleep) -> u32 {
        match mode {
            CPUSleep::WaitForInterrupt => 0,
            CPUSleep::WaitForEvent => 1,
            CPUSleep::ForbidSleep => 2,
            CPUSleep::AllowSleep => 3,
        }
    }
}

impl TryFrom<u32> for CPUSleep {
    type Error = Status;
    fn try_from(mode: u32) -> Result<CPUSleep, Self::Error> {
        match mode {
            0 => Ok(CPUSleep::WaitForInterrupt),
            1 => Ok(CPUSleep::WaitForEvent),
            2 => Ok(CPUSleep::ForbidSleep),
            3 => Ok(CPUSleep::AllowSleep),
            _ => Err(Status::Invalid),
        }
    }
}

mirror_enum! {
    u32,
    pub enum Precision {
        Cycle,
        Nanoseconds,
        Microseconds,
        Milliseconds,
    }
}

/// Device related types definitions
pub mod dev {

    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct InterruptInfo {
        /// interrupt number
        pub num: u16,
        /// interrupt controler identifier
        pub controller: u8,
    }

    #[test]
    fn test_layout_it_info() {
        const UNINIT: ::std::mem::MaybeUninit<InterruptInfo> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<InterruptInfo>(),
            4usize,
            concat!("Size of: ", stringify!(InterruptInfo))
        );
        assert_eq!(
            ::std::mem::align_of::<InterruptInfo>(),
            2usize,
            concat!("Alignment of ", stringify!(InterruptInfo))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).num) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(InterruptInfo),
                "::",
                stringify!(num)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).controller) as usize - ptr as usize },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(InterruptInfo),
                "::",
                stringify!(controller)
            )
        );
    }

    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct IoInfo {
        /// GPIO port identifier, declared in DTS
        pub port: u8,
        /// GPIO pin identifier, declared in DTS
        pub pin: u8,
        pub mode: u8,
        /// GPIO AF identifier, declared in DTS
        pub af: u8,
        /// GPIO ppull config, declared in DTS
        pub ppull: u8,
        /// GPIO speed config, declared in DTS
        pub speed: u8,
        // GPIO pupdr config, declared in DTS
        pub pupdr: u32,
    }
    #[test]
    fn test_layout_io_info() {
        const UNINIT: ::std::mem::MaybeUninit<IoInfo> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<IoInfo>(),
            12usize,
            concat!("Size of: ", stringify!(IoInfo))
        );
        assert_eq!(
            ::std::mem::align_of::<IoInfo>(),
            4usize,
            concat!("Alignment of ", stringify!(IoInfo))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).port) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(IoInfo),
                "::",
                stringify!(port)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).pin) as usize - ptr as usize },
            1usize,
            concat!(
                "Offset of field: ",
                stringify!(IoInfo),
                "::",
                stringify!(pin)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(IoInfo),
                "::",
                stringify!(mode)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).af) as usize - ptr as usize },
            3usize,
            concat!(
                "Offset of field: ",
                stringify!(IoInfo),
                "::",
                stringify!(af)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ppull) as usize - ptr as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(IoInfo),
                "::",
                stringify!(ppull)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).speed) as usize - ptr as usize },
            5usize,
            concat!(
                "Offset of field: ",
                stringify!(IoInfo),
                "::",
                stringify!(speed)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).pupdr) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(IoInfo),
                "::",
                stringify!(pupdr)
            )
        );
    }

    /// userspace oriented device definition
    ///
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct DevInfo {
        pub id: u32,
        /// mappable device. Direct-IO (LED...) are not
        pub mappable: bool,
        /// for mappable devices, base address
        pub baseaddr: usize,
        /// for mappable devices, mapped size */\n/**<\n  number of device's interrupt.
        /// Can be EXTI (button) or NVIC interrupts (SoC device)
        pub size: usize,
        /// number of device interrupts
        pub num_interrupt: u8,
        /// device interrupt list
        pub its: [InterruptInfo; 8usize],
        /// number of device I/O (pinmux)
        pub num_ios: u8,
        /// device I/O list
        pub ios: [IoInfo; 8usize],
    }
    #[test]
    fn test_layout_devinfo() {
        const UNINIT: ::std::mem::MaybeUninit<DevInfo> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<DevInfo>(),
            160usize,
            concat!("Size of: ", stringify!(DevInfo))
        );
        assert_eq!(
            ::std::mem::align_of::<DevInfo>(),
            8usize,
            concat!("Alignment of ", stringify!(DevInfo))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(DevInfo),
                "::",
                stringify!(id)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).mappable) as usize - ptr as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(DevInfo),
                "::",
                stringify!(mappable)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).baseaddr) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(DevInfo),
                "::",
                stringify!(baseaddr)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(DevInfo),
                "::",
                stringify!(size)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).num_interrupt) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(DevInfo),
                "::",
                stringify!(num_interrupt)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).its) as usize - ptr as usize },
            26usize,
            concat!(
                "Offset of field: ",
                stringify!(DevInfo),
                "::",
                stringify!(its)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).num_ios) as usize - ptr as usize },
            58usize,
            concat!(
                "Offset of field: ",
                stringify!(DevInfo),
                "::",
                stringify!(num_ios)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).ios) as usize - ptr as usize },
            60usize,
            concat!(
                "Offset of field: ",
                stringify!(DevInfo),
                "::",
                stringify!(ios)
            )
        );
    }
}

/// SHM related types definitions
pub mod shm {

    #[repr(C)]
    #[derive(PartialEq, Debug, Copy, Clone)]
    pub struct ShmInfo {
        pub handle: crate::systypes::ShmHandle,
        pub label: u32,
        pub base: usize,
        pub len: usize,
        pub perms: u32,
    }

    #[test]
    fn test_layout_shm_infos() {
        const UNINIT: ::std::mem::MaybeUninit<ShmInfo> = ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<ShmInfo>(),
            32usize,
            concat!("Size of: ", stringify!(ShmInfo))
        );
        assert_eq!(
            ::std::mem::align_of::<ShmInfo>(),
            8usize,
            concat!("Alignment of ", stringify!(ShmInfo))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ShmInfo),
                "::",
                stringify!(handle)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).label) as usize - ptr as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(shm_infos),
                "::",
                stringify!(label)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).base) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(shm_infos),
                "::",
                stringify!(base)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(shm_infos),
                "::",
                stringify!(len)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).perms) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(shm_infos),
                "::",
                stringify!(perms)
            )
        );
    }
}

/// DMA related types definitions
///
/// In order to help with proper hierarchy of types for Sentry UAPI, syscall families
/// that requires a lot of shared types. This is the case of the DMA subsystem for
/// which all related types and types helpers are stored in the dma submodule.
pub mod dma {
    // FIXME: this enum is used for bitfield-based manipulation, as the
    // interrupts field is a local OR of this enumerate values
    pub enum GpdmaChanInt {
        /// DMA channel trigger on transfer complete
        TransferComplete = 1,
        /// DMA channel trigger on half transfer and transfer complete
        HalfTransfer = 2,
        /// triggers on DMA transfer or config error, get status for complete information
        DmaError = 4,
    }

    // FIXME: the interrupts field is a bitfield of one to 3 possible interrupts
    // we mai consider intlevels (TC+Error, TC+HT+Error, etc.) meaning that the field
    // is no more a bitfield
    impl TryFrom<u8> for GpdmaChanInt {
        type Error = crate::systypes::Status;
        fn try_from(mode: u8) -> Result<GpdmaChanInt, Self::Error> {
            match mode {
                1 => Ok(GpdmaChanInt::TransferComplete),
                2 => Ok(GpdmaChanInt::HalfTransfer),
                4 => Ok(GpdmaChanInt::DmaError),
                _ => Err(crate::systypes::Status::Invalid),
            }
        }
    }

    pub enum GpdmaTransferType {
        MemoryToDevice = 0,
        DeviceToMemory = 1,
        MemoryToMemory = 2,
        DeviceToDevice = 3,
    }

    impl TryFrom<u16> for GpdmaTransferType {
        type Error = crate::systypes::Status;
        fn try_from(mode: u16) -> Result<GpdmaTransferType, Self::Error> {
            match mode {
                0 => Ok(GpdmaTransferType::MemoryToDevice),
                1 => Ok(GpdmaTransferType::DeviceToMemory),
                2 => Ok(GpdmaTransferType::MemoryToMemory),
                3 => Ok(GpdmaTransferType::DeviceToDevice),
                _ => Err(crate::systypes::Status::Invalid),
            }
        }
    }

    // FIXME: this is a bitmask. We may consider moving to enum value instead
    // for e.g. by using IncrementBoth = 3
    pub enum GpdmaTransferMode {
        IncrementNone = 0,
        IncrementSrc = 1,
        IncrementDest = 2,
    }

    pub enum GpdmaBeatLen {
        /// Data len to manipulate is in bytes
        Byte = 0,
        /// Data len to manipulate is in half word
        Halfword = 1,
        /// Data len to manipulate is in word
        Word = 2,
    }

    impl TryFrom<u8> for GpdmaBeatLen {
        type Error = crate::systypes::Status;
        fn try_from(mode: u8) -> Result<GpdmaBeatLen, Self::Error> {
            match mode {
                0 => Ok(GpdmaBeatLen::Byte),
                1 => Ok(GpdmaBeatLen::Halfword),
                2 => Ok(GpdmaBeatLen::Word),
                _ => Err(crate::systypes::Status::Invalid),
            }
        }
    }

    pub enum GpdmaPriority {
        Low = 0,
        Medium = 1,
        High = 2,
        VeryHigh = 3,
    }

    impl TryFrom<u8> for GpdmaPriority {
        type Error = crate::systypes::Status;
        fn try_from(mode: u8) -> Result<GpdmaPriority, Self::Error> {
            match mode {
                0 => Ok(GpdmaPriority::Low),
                1 => Ok(GpdmaPriority::Medium),
                2 => Ok(GpdmaPriority::High),
                3 => Ok(GpdmaPriority::VeryHigh),
                _ => Err(crate::systypes::Status::Invalid),
            }
        }
    }

    /// DMA static configuration information
    ///
    /// # Usage
    ///
    /// This structure is delivered by the kernel into svc_exchange when
    /// calling successfully [`crate::syscall::dma_get_stream_info()`].
    ///
    /// The structure content correspond to the static build-time information
    /// as defined in the device-tree and do not require any DTS manipulation
    /// in user-space.
    ///
    /// # Example
    ///
    /// ```ignore
    /// let dmacfg: dma_stream_cfg;
    /// match get_dma_stream_info(dmah) {
    ///    Status::Ok => (svc_exchange::copy_from(&dma_stream_cfg, mem::sizeof(dma_stream_cfg)))
    /// }
    /// ```
    ///
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct GpdmaStreamConfig {
        pub channel: u16,
        pub stream: u16,
        pub controller: u16,
        pub transfer_type: u16,
        pub source: usize,
        pub dest: usize,
        pub transfer_len: usize,
        pub circular_source: bool,
        pub circular_dest: bool,
        pub interrupts: u8,
        pub is_triggered: bool,
        pub trigger: u8,
        pub priority: u8,
        pub transfer_mode: u8,
        pub src_beat_len: u8,
        pub dest_beat_len: u8,
    }

    // test that the Rust structure fields offset do match the corresponding C one,
    // as the kernel delivers in its ABI the C-defined structure
    #[test]
    fn test_layout_gpdma_stream_cfg() {
        const UNINIT: ::std::mem::MaybeUninit<GpdmaStreamConfig> =
            ::std::mem::MaybeUninit::uninit();
        let ptr = UNINIT.as_ptr();
        assert_eq!(
            ::std::mem::size_of::<GpdmaStreamConfig>(),
            48usize,
            concat!("Size of: ", stringify!(GpdmaStreamConfig))
        );
        assert_eq!(
            ::std::mem::align_of::<GpdmaStreamConfig>(),
            8usize,
            concat!("Alignment of ", stringify!(GpdmaStreamConfig))
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).channel) as usize - ptr as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(GpdmaStreamConfig),
                "::",
                stringify!(channel)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).stream) as usize - ptr as usize },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(gpdma_stream_cfg),
                "::",
                stringify!(stream)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).controller) as usize - ptr as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(gpdma_stream_cfg),
                "::",
                stringify!(controller)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).transfer_type) as usize - ptr as usize },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(gpdma_stream_cfg),
                "::",
                stringify!(transfer_type)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).source) as usize - ptr as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(gpdma_stream_cfg),
                "::",
                stringify!(source)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).dest) as usize - ptr as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(gpdma_stream_cfg),
                "::",
                stringify!(dest)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).transfer_len) as usize - ptr as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(gpdma_stream_cfg),
                "::",
                stringify!(transfer_len)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).circular_source) as usize - ptr as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(gpdma_stream_cfg),
                "::",
                stringify!(circular_source)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).circular_dest) as usize - ptr as usize },
            33usize,
            concat!(
                "Offset of field: ",
                stringify!(gpdma_stream_cfg),
                "::",
                stringify!(circular_dest)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).interrupts) as usize - ptr as usize },
            34usize,
            concat!(
                "Offset of field: ",
                stringify!(gpdma_stream_cfg),
                "::",
                stringify!(interrupts)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).is_triggered) as usize - ptr as usize },
            35usize,
            concat!(
                "Offset of field: ",
                stringify!(gpdma_stream_cfg),
                "::",
                stringify!(is_triggered)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).trigger) as usize - ptr as usize },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(gpdma_stream_cfg),
                "::",
                stringify!(trigger)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).priority) as usize - ptr as usize },
            37usize,
            concat!(
                "Offset of field: ",
                stringify!(gpdma_stream_cfg),
                "::",
                stringify!(priority)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).transfer_mode) as usize - ptr as usize },
            38usize,
            concat!(
                "Offset of field: ",
                stringify!(gpdma_stream_cfg),
                "::",
                stringify!(transfer_mode)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).src_beat_len) as usize - ptr as usize },
            39usize,
            concat!(
                "Offset of field: ",
                stringify!(gpdma_stream_cfg),
                "::",
                stringify!(src_beat_len)
            )
        );
        assert_eq!(
            unsafe { ::std::ptr::addr_of!((*ptr).dest_beat_len) as usize - ptr as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(gpdma_stream_cfg),
                "::",
                stringify!(dest_beat_len)
            )
        );
    }

    pub enum GpdmaChanState {
        Idle = 1,
        Running = 2,
        Aborted = 3,
        Suspended = 4,
        TransmissionFailure = 5,
        ConfigurationFailure = 6,
        Overrun = 7,
        TransferComplete = 8,
        HalfTransfer = 9,
    }
}
